app/controllers/incidents_controller.rb

  def index
    @incidents = Incident.all
---
SELECT "incidents".* FROM "incidents"

  def create
    @incident = Incident.new(incident_params)

    @incident.duration = @incident.duration * 60

    if @incident.occurance.nil?
      @incident.occurance = DateTime.now
    end

    respond_to do |format|
      if @incident.save
---
INSERT INTO "incidents" ("name", "duration", "occurance", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Test"], ["duration", 30], ["occurance", "2015-08-10 17:52:00.000000"], ["created_at", "2015-08-10 17:53:04.662967"], ["updated_at", "2015-08-10 17:53:04.662967"]]

  def destroy
    @incident.destroy
---
DELETE FROM "incidents" WHERE "incidents"."id" = ?  [["id", 2]]

    def set_incident
      @incident = Incident.find(params[:id])
---
SELECT  "incidents".* FROM "incidents" WHERE "incidents"."id" = ? LIMIT 1  [["id", 2]]